#include <stdio.h>

/**
作业: 
   计算字符串中的单词数目 
   hello world！ 
   there is no char! 
   从空格的角度入手，对字符串进行分割！ 
**/
int main()
{
    //定义字符数组
    char ch[6]; 
    //引用字符数组
    ch[0]='a';
    ch[1]='b';
    int i;
    for(i=0;i<6;i++)
    {
          printf("下标为%d的字符数组元素是%c\n",i,ch[i]);          
    } 
   
    //初始化
    //1
    char ch[6]={'a','b','c','d','f','\0'}; 
    //2
    char ch[6]={"abcdef"};
    //3
    char ch[6]="abcdef"; //字符串常用的表示方式  
    
    //字符数组的结束标志('\0') 
    
    //多维数组
    //定义一个三维数组 
    int sum[2][3][4]; 
    //引用三维数组
    sum[0][0][0]=10;
    //初始化
    int sum1[2][3][2]={//2*3*2 
        {
            {12,23},
            {34,342} 
        },
        {
           {12,23},
            {34,342} 
        },
        {
            {12,23},
            {34,342}          
        }
    }

    return 0;
}
