#include <stdio.h>

/**
作业: 
   3*3矩阵 
   语文、数学、英语 3门课程的成绩表，学生人数为8
   num[3][8] 、num[10][3] 
**/
int main()
{
    //定义二维数组 
    int sum[2][2];
    //如何引用二维数组
    //4.二维数组也可以直接对数组元素赋值
    sum[0][0]=1;
    sum[0][1]=2;
    sum[1][0]=3;
    sum[1][1]=4;
    int i,j;
    for(i=0;i<2;i++)
    {
         for(j=0;j<2;j++)
         {
              printf("i=%d,j=%d,sum[%d][%d]=%d\n",i,j,i,j,sum[i][j]);           
         }  
    } 
    //初始化
    //1.可以将所有的数据写在一个大括号内，按照数组元素的排列顺序对元素赋值
    int number[2][3]={1,2,3,4,5,6};
    //2.在为所有元素赋初值时，可以省略行下标，但是不能省略下标
    int number1[][3]={1,2,3,4,5,6};
    //3.可以分行给数组元素赋值
    int number2[][3]={
        {1,2,3},
        {4,5,6}
        };
    number2[1][0]=18;
    
    system("pause");
    return 0;    
}
